content/make/gnu-make-manual/apppendix-a-quick-reference.org
# -*- coding:utf-8-*-
#+TITLE: Appendix A Quick Reference
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

